esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
<?xml version="1.0" ?>
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xsi:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1.1.xsd">
  <vendor>ESPRESSIF SYSTEMS (SHANGHAI) CO., LTD.</vendor>
  <vendorID>ESPRESSIF</vendorID>
  <name>ESP32-C61</name>
  <series>ESP32 C-Series</series>
  <version>1</version>
  <description>32-bit RISC-V MCU &amp; 2.4 GHz Wi-Fi 6 &amp; Bluetooth 5 (LE) </description>
  <licenseText>
    Copyright 2025 Espressif Systems (Shanghai) PTE LTD

    Licensed under the Apache License, Version 2.0 (the &quot;License&quot;);
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an &quot;AS IS&quot; BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
</licenseText>
  <cpu>
    <name>RV32IMAC</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>0</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>32</addressUnitBits>
  <width>32</width>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>AHB_DMA</name>
      <description>AHB_DMA Peripheral</description>
      <groupName>AHB_DMA</groupName>
      <baseAddress>0x60080000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x188</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IN_INT_RAW_CH0</name>
          <description>Raw interrupt status of RX channel 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_OVF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_UDF_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_RESP_ERR_CH0_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_ST_CH0</name>
          <description>Masked interrupt status of RX channel 0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_OVF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_UDF_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_RESP_ERR_CH0_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_ENA_CH0</name>
          <description>Interrupt enable bits of RX channel 0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_SUC_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_ERR_EOF_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_OVF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_UDF_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_RESP_ERR_CH0_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_CLR_CH0</name>
          <description>Interrupt clear bits of RX channel 0</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_SUC_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_ERR_EOF_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_ERR_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_EMPTY_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_OVF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_UDF_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_RESP_ERR_CH0_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_RAW_CH1</name>
          <description>Raw interrupt status of RX channel 1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_OVF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_UDF_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_RESP_ERR_CH1_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_ST_CH1</name>
          <description>Masked interrupt status of RX channel 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_OVF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_UDF_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_RESP_ERR_CH1_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_ENA_CH1</name>
          <description>Interrupt enable bits of RX channel 1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_SUC_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_ERR_EOF_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_OVF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_UDF_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_RESP_ERR_CH1_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_CLR_CH1</name>
          <description>Interrupt clear bits of RX channel 1</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_SUC_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_ERR_EOF_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_ERR_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_EMPTY_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_OVF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_UDF_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_RESP_ERR_CH1_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
