esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
        <register>
          <name>IN_CONF1_CH0</name>
          <description>Configuration register 1 of RX channel 0</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_CHECK_OWNER_CH0</name>
              <description>Configures whether to enable owner bit check for RX channel 0.\\0: Disable\\1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INFIFO_STATUS_CH0</name>
          <description>Receive FIFO status of RX channel 0</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x7800003</resetValue>
          <fields>
            <field>
              <name>INFIFO_FULL_CH0</name>
              <description>Represents whether L1 RX FIFO is full.\\0: Not Full\\1: Full\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_EMPTY_CH0</name>
              <description>Represents whether L1 RX FIFO is empty.\\0: Not empty\\1: Empty\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_CNT_CH0</name>
              <description>Represents the number of data bytes in L1 RX FIFO for RX channel 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_1B_CH0</name>
              <description>reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_2B_CH0</name>
              <description>reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_3B_CH0</name>
              <description>reserved</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_REMAIN_UNDER_4B_CH0</name>
              <description>reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_BUF_HUNGRY_CH0</name>
              <description>reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_POP_CH0</name>
          <description>Receive FIFO status of RX channel 0</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x800</resetValue>
          <fields>
            <field>
              <name>INFIFO_RDATA_CH0</name>
              <description>Represents the data popped from AHB_DMA FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_POP_CH0</name>
              <description>Configures whether to pop data from AHB_DMA FIFO.\\0: Invalid. No effect\\1: Pop\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_LINK_CH0</name>
          <description>Receive FIFO status of RX channel 0</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>INLINK_AUTO_RET_CH0</name>
              <description>Configures whether to return to current receive descriptor's address when there are some errors in current receiving data.\\0: Not return\\1: Return\\.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INLINK_STOP_CH0</name>
              <description>Configures whether to stop AHB_DMA's RX channel 0 from receiving data.\\0: Invalid. No effect\\1: Stop\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INLINK_START_CH0</name>
              <description>Configures whether to enable AHB_DMA's RX channel 0 for data transfer.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INLINK_RESTART_CH0</name>
              <description>Configures whether to restart RX channel 0 for AHB_DMA transfer.\\0: Invalid. No effect\\1: Restart\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INLINK_PARK_CH0</name>
              <description>Represents the status of the receive descriptor's FSM.\\0: Running\\1: Idle\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_STATE_CH0</name>
          <description>Receive status of RX channel 0</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_DSCR_ADDR_CH0</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_STATE_CH0</name>
              <description>reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_STATE_CH0</name>
              <description>Represents the address of the lower 18 bits of the next receive descriptor to be processed.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_SUC_EOF_DES_ADDR_CH0</name>
          <description>Receive descriptor address when EOF occurs on RX channel 0</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_SUC_EOF_DES_ADDR_CH0</name>
              <description>Represents the address of the receive descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_ERR_EOF_DES_ADDR_CH0</name>
          <description>Receive descriptor address when errors occur of RX channel 0</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_ERR_EOF_DES_ADDR_CH0</name>
              <description>Represents the address of the receive descriptor when there are some errors in the currently received data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DSCR_CH0</name>
          <description>Current receive descriptor address of RX channel 0</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_DSCR_CH0</name>
              <description>Represents the address of the next receive descriptor x+1 pointed by the current receive descriptor that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DSCR_BF0_CH0</name>
          <description>The last receive descriptor address of RX channel 0</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_DSCR_BF0_CH0</name>
              <description>Represents the address of the current receive descriptor x that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DSCR_BF1_CH0</name>
          <description>The second-to-last receive descriptor address of RX channel 0</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_DSCR_BF1_CH0</name>
              <description>Represents the address of the previous receive descriptor x-1 that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_PERI_CH0</name>
          <description>Priority register of RX channel 0</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_PRI_CH0</name>
              <description>Configures the priority of RX channel 0.The larger of the value, the higher of the priority..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_PERI_SEL_CH0</name>
          <description>Peripheral selection register of RX channel 0</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x3f</resetValue>
          <fields>
            <field>
              <name>PERI_IN_SEL_CH0</name>
              <description>Configures the peripheral connected to RX channel 0.\\ 0: Dummy\\ 1: SPI2\\ 2: UHCI0\\ 3: I2S0\\ 4: Dummy\\ 5: Dummy\\ 6: AES\\ 7: SHA\\ 8: ADC_DAC\\ 9: PARL_IO\\ 10: Dummy\\ 11~15: Dummy\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DONE_DES_ADDR_CH0</name>
          <description>RX_done Inlink descriptor address of RX channel 0</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_DES_ADDR_CH0</name>
              <description>Represents the address of the inlink descriptor when  this descriptor is completed .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CONF0_CH0</name>
          <description>Configuration register 0 of TX channel 0</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>OUT_RST_CH0</name>
              <description>Configures the reset state of AHB_DMA channel 0 TX FSM and TX FIFO pointer.\\0: Release reset\\1: Reset\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_LOOP_TEST_CH0</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AUTO_WRBACK_CH0</name>
              <description>Configures whether to enable automatic outlink write-back when all the data in TX FIFO has been transmitted.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_MODE_CH0</name>
              <description>Configures when to generate EOF flag.\\0: EOF flag for TX channel 0 is generated when data to be transmitted has been pushed into FIFO in AHB_DMA.\\ 1: EOF flag for TX channel 0 is generated when data to be transmitted has been popped from FIFO in AHB_DMA.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDSCR_BURST_EN_CH0</name>
              <description>Configures whether to enable INCR burst transfer for TX channel 0 reading descriptors.\\0: Disable\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ETM_EN_CH0</name>
              <description>Configures whether to enable ETM control for TX channel 0.\\0: Disable\\1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DATA_BURST_MODE_SEL_CH0</name>
              <description>Configures max burst size for TX channel0.\\2'b00: single\\ 2'b01: incr4\\ 2'b10: incr8\\ 2'b11: incr16\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CONF1_CH0</name>
          <description>Configuration register 1 of TX channel 0</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_CHECK_OWNER_CH0</name>
              <description>Configures whether to enable owner bit check for TX channel 0.\\0: Disable\\1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTFIFO_STATUS_CH0</name>
          <description>Receive FIFO status of RX channel 0</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0x7800002</resetValue>
          <fields>
            <field>
              <name>OUTFIFO_FULL_CH0</name>
              <description>Represents whether L1 TX FIFO is full.\\0: Not Full\\1: Full\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_EMPTY_CH0</name>
              <description>Represents whether L1 TX FIFO is empty.\\0: Not empty\\1: Empty\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_CNT_CH0</name>
              <description>Represents the number of data bytes in L1 TX FIFO for TX channel 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_1B_CH0</name>
              <description>reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_2B_CH0</name>
              <description>reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_3B_CH0</name>
              <description>reserved</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_4B_CH0</name>
              <description>reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PUSH_CH0</name>
          <description>Push control register of TX channel 0</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTFIFO_WDATA_CH0</name>
              <description>Configures whether to push data into AHB_DMA FIFO.\\0: Invalid. No effect\\1: Push\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_PUSH_CH0</name>
              <description>Configures the data that need to be pushed into AHB_DMA FIFO.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LINK_CH0</name>
          <description>Push control register of TX channel 0</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>OUTLINK_STOP_CH0</name>
              <description>Configures whether to stop AHB_DMA's TX channel 0 from transmitting data.\\0: Invalid. No effect\\1: Stop\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_START_CH0</name>
              <description>Configures whether to enable AHB_DMA's TX channel 0 for data transfer.\\0: Disable\\1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_RESTART_CH0</name>
              <description>Configures whether to restart TX channel 0 for AHB_DMA transfer.\\0: Invalid. No effect\\1: Restart\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_PARK_CH0</name>
              <description>Represents the status of the transmit descriptor's FSM.\\0: Running\\1: Idle\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_STATE_CH0</name>
          <description>Transmit status of TX channel 0</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_ADDR_CH0</name>
              <description>Represents the lower 18 bits of the address of the next transmit descriptor to be processed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_STATE_CH0</name>
              <description>reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_STATE_CH0</name>
              <description>reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_EOF_DES_ADDR_CH0</name>
          <description>Transmit descriptor address when EOF occurs on TX channel 0</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_DES_ADDR_CH0</name>
              <description>Represents the address of the transmit descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_EOF_BFR_DES_ADDR_CH0</name>
          <description>The last transmit descriptor address when EOF occurs on TX channel 0</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_BFR_DES_ADDR_CH0</name>
              <description>Represents the address of the transmit descriptor before the last transmit descriptor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DSCR_CH0</name>
          <description>Current transmit descriptor address of TX channel 0</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_CH0</name>
              <description>Represents the address of the next transmit descriptor y+1 pointed by the current transmit descriptor that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
