esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
        <register>
          <name>OUT_PUSH_CH1</name>
          <description>Push control register of TX channel 1</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTFIFO_WDATA_CH1</name>
              <description>Configures whether to push data into AHB_DMA FIFO.\\0: Invalid. No effect\\1: Push\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_PUSH_CH1</name>
              <description>Configures the data that need to be pushed into AHB_DMA FIFO.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LINK_CH1</name>
          <description>Push control register of TX channel 1</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>OUTLINK_STOP_CH1</name>
              <description>Configures whether to stop AHB_DMA's TX channel 1 from transmitting data.\\0: Invalid. No effect\\1: Stop\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_START_CH1</name>
              <description>Configures whether to enable AHB_DMA's TX channel 1 for data transfer.\\0: Disable\\1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_RESTART_CH1</name>
              <description>Configures whether to restart TX channel 1 for AHB_DMA transfer.\\0: Invalid. No effect\\1: Restart\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_PARK_CH1</name>
              <description>Represents the status of the transmit descriptor's FSM.\\0: Running\\1: Idle\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_STATE_CH1</name>
          <description>Transmit status of TX channel 1</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_ADDR_CH1</name>
              <description>Represents the lower 18 bits of the address of the next transmit descriptor to be processed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_STATE_CH1</name>
              <description>reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_STATE_CH1</name>
              <description>reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_EOF_DES_ADDR_CH1</name>
          <description>Transmit descriptor address when EOF occurs on TX channel 1</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_DES_ADDR_CH1</name>
              <description>Represents the address of the transmit descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_EOF_BFR_DES_ADDR_CH1</name>
          <description>The last transmit descriptor address when EOF occurs on TX channel 1</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_BFR_DES_ADDR_CH1</name>
              <description>Represents the address of the transmit descriptor before the last transmit descriptor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DSCR_CH1</name>
          <description>Current transmit descriptor address of TX channel 1</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_CH1</name>
              <description>Represents the address of the next transmit descriptor y+1 pointed by the current transmit descriptor that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DSCR_BF0_CH1</name>
          <description>The last transmit descriptor address of TX channel 1</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF0_CH1</name>
              <description>Represents the address of the current transmit descriptor y that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DSCR_BF1_CH1</name>
          <description>The second-to-last transmit descriptor address of TX channel 1</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF1_CH1</name>
              <description>Represents the address of the previous transmit descriptor y-1 that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PERI_CH1</name>
          <description>Priority register of TX channel 1</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_PRI_CH1</name>
              <description>Configures the priority of TX channel 1.The larger of the value, the higher of the priority..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PERI_SEL_CH1</name>
          <description>Peripheral selection register of TX channel 1</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <resetValue>0x3f</resetValue>
          <fields>
            <field>
              <name>PERI_OUT_SEL_CH1</name>
              <description>Configures the peripheral connected to TX channel 1.\\ 0: Dummy\\ 1: SPI2\\ 2: UHCI0\\ 3: I2S0\\ 4: Dummy\\ 5: Dummy\\ 6: AES\\ 7: SHA\\ 8: ADC_DAC\\ 9: PARL_IO\\ 10: Dummy\\ 11~15: Dummy\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DONE_DES_ADDR_CH1</name>
          <description>TX done outlink descriptor address of TX channel 1</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_DES_ADDR_CH1</name>
              <description>Represents the address of the outlink descriptor when this descriptor is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CH_ARB_WEIGHT_CH0</name>
          <description>TX channel 0 arbitration weight configuration register</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_VALUE_CH0</name>
              <description>Configures the weight(i.e the number of tokens) of TX channel0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_ARB_WEIGHT_OPT_DIR_CH0</name>
          <description>TX channel 0 weight arbitration optimization enable register</description>
          <addressOffset>0x2e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_OPT_DIS_CH0</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CH_ARB_WEIGHT_CH1</name>
          <description>TX channel 1 arbitration weight configuration register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_VALUE_CH1</name>
              <description>Configures the weight(i.e the number of tokens) of TX channel1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_ARB_WEIGHT_OPT_DIR_CH1</name>
          <description>TX channel 1 weight arbitration optimization enable register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_OPT_DIS_CH1</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH_ARB_WEIGHT_CH0</name>
          <description>RX channel 0 arbitration weight configuration register</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_VALUE_CH0</name>
              <description>Configures the weight(i.e the number of tokens) of RX channel0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ARB_WEIGHT_OPT_DIR_CH0</name>
          <description>RX channel 0 weight arbitration optimization enable register</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_OPT_DIS_CH0</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH_ARB_WEIGHT_CH1</name>
          <description>RX channel 1 arbitration weight configuration register</description>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_VALUE_CH1</name>
              <description>Configures the weight(i.e the number of tokens) of RX channel1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ARB_WEIGHT_OPT_DIR_CH1</name>
          <description>RX channel 1 weight arbitration optimization enable register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_OPT_DIS_CH1</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_LINK_ADDR_CH0</name>
          <description>Link list descriptor address configuration of RX channel 0</description>
          <addressOffset>0x3ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_ADDR_CH0</name>
              <description>Configures the 32 bits of the first receive descriptor's address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_LINK_ADDR_CH1</name>
          <description>Link list descriptor address configuration of RX channel 1</description>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_ADDR_CH1</name>
              <description>Configures the 32 bits of the first receive descriptor's address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LINK_ADDR_CH0</name>
          <description>Link list descriptor address configuration of TX channel 0</description>
          <addressOffset>0x3b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_ADDR_CH0</name>
              <description>Configures the 32 bits of the first receive descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LINK_ADDR_CH1</name>
          <description>Link list descriptor address configuration of TX channel 1</description>
          <addressOffset>0x3bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_ADDR_CH1</name>
              <description>Configures the 32 bits of the first receive descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_START_ADDR</name>
          <description>Accessible address space start address configuration register</description>
          <addressOffset>0x3c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_START_ADDR</name>
              <description>Accessible address space start address configuration register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_END_ADDR</name>
          <description>Accessible address space end address configuration register</description>
          <addressOffset>0x3c8</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_END_ADDR</name>
              <description>Configures the end address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT_TX</name>
          <description>TX arbitration timeout configuration register</description>
          <addressOffset>0x3cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARB_TIMEOUT_TX</name>
              <description>Configures the time slot for TX. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT_RX</name>
          <description>RX arbitration timeout configuration register</description>
          <addressOffset>0x3d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARB_TIMEOUT_RX</name>
              <description>Configures the time slot for RX. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN_TX</name>
          <description>TX weight arbitration enable register</description>
          <addressOffset>0x3d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WEIGHT_EN_TX</name>
              <description>Configures whether to enable weight arbitration for TX.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN_RX</name>
          <description>RX weight arbitration enable register</description>
          <addressOffset>0x3d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WEIGHT_EN_RX</name>
              <description>Configures whether to enable weight arbitration for RX.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT</name>
          <description>TX arbitration timeout configuration register</description>
          <addressOffset>0x3dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NUM</name>
              <description>Configures the time slot. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN</name>
          <description>TX weight arbitration enable register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WEIGHT_EN</name>
              <description>Configures whether to enable weight arbitration.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODULE_CLK_EN</name>
          <description>Module clock force on register</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <resetValue>0x7ff</resetValue>
          <fields>
            <field>
              <name>AHB_APB_SYNC_CLK_EN</name>
              <description>Configures whether to force on ahb_apb_sync 1~0 module clock. For bit n:\\0 : Not force on ahb_apb_sync n clock \\1 : Force on ahb_apb_sync n clock\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_CLK_EN</name>
              <description>Configures whether to force on out_dscr 1~0 module clock. For bit n:\\0 : Not force on out_dscr n clock \\1 : Force on out_dscr n clock\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CTRL_CLK_EN</name>
              <description>Configures whether to force on out_ctrl 1~0 module clock. For bit n:\\0 : Not force on out_ctrl n clock \\1 : Force on out_ctrl n clock\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_CLK_EN</name>
              <description>Configures whether to force on in_dscr 1~0 module clock. For bit n:\\0 : Not force on in_dscr n clock \\1 : Force on in_dscr n clock\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CTRL_CLK_EN</name>
              <description>Configures whether to force on in_ctrl 1~0 module clock. For bit n:\\0 : Not force on in_ctrl n clock \\1 : Force on in_ctrl n clock\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_ARB_CLK_EN</name>
              <description>Configures whether to force on cmd_arb module clock. \\0 : Not force on cmd_arb clock \\1 : Force on cmd_arb clock\\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBINF_CLK_EN</name>
              <description>Configures whether to force on ahbinf module clock. \\0 : Not force on ahbinf clock \\1 : Force on ahbinf clock\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
