esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BUS_MONITOR</name>
      <description>BUS_MONITOR Peripheral</description>
      <groupName>BUS_MONITOR</groupName>
      <baseAddress>0x600c2000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x88</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CORE_0_MONTR_ENA</name>
          <description>core0 monitor enable configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_RD_ENA</name>
              <description>Configures whether to monitor read operations in region 0 by the Data bus. \\
0: Not monitor\\
1: Monitor\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_0_WR_ENA</name>
              <description>Configures whether to monitor write operations in region 0 by the Data bus.\\
0: Not monitor\\
1: Monitor\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_RD_ENA</name>
              <description>Configures whether to monitor read operations in region 1 by the Data bus.\\
0: Not Monitor\\
1: Monitor\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_WR_ENA</name>
              <description>Configures whether to monitor write operations in region 1 by the Data bus.\\
0: Not Monitor\\
1: Monitor\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_RD_ENA</name>
              <description>Configures whether to monitor read operations in region 0 by the Peripheral bus.\\
0: Not Monitor\\
1: Monitor\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_WR_ENA</name>
              <description>Configures whether to monitor write operations in region 0 by the Peripheral bus.\\
0: Not Monitor\\
1: Monitor\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_RD_ENA</name>
              <description>Configures whether to monitor read operations in region 1 by the Peripheral bus.\\
0: Not Monitor\\
1: Monitor\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_WR_ENA</name>
              <description>Configures whether to monitor write operations in region 1 by the Peripheral bus.\\
0: Not Monitor\\
1: Monitor\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MIN_ENA</name>
              <description>Configures whether to monitor SP exceeding the lower bound address of SP monitored region.\\
0: Not Monitor\\
1: Monitor\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MAX_ENA</name>
              <description>Configures whether to monitor SP exceeding the upper bound address of SP monitored region.\\
0: Not Monitor\\
1: Monitor\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_EXCEPTION_MONITOR_ENA</name>
              <description>IBUS busy monitor enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_EXCEPTION_MONITOR_ENA</name>
              <description>DBUS busy monitor enbale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_INTR_RAW</name>
          <description>core0 monitor interrupt status register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_RD_RAW</name>
              <description>The raw interrupt status of read operations in region 0 by Data bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_0_WR_RAW</name>
              <description>The raw interrupt status of write operations in region 0 by Data bus.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_RD_RAW</name>
              <description>The raw interrupt status of read operations in region 1 by Data bus.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_WR_RAW</name>
              <description>The raw interrupt status of write operations in region 1 by Data bus.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_RD_RAW</name>
              <description>The raw interrupt status of read operations in region 0 by Peripheral bus.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_WR_RAW</name>
              <description>The raw interrupt status of write operations in region 0 by Peripheral bus.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_RD_RAW</name>
              <description>The raw interrupt status of read operations in region 1 by Peripheral bus.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_WR_RAW</name>
              <description>The raw interrupt status of write operations in region 1 by Peripheral bus.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MIN_RAW</name>
              <description>The raw interrupt status of SP exceeding the lower bound address of SP monitored region.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MAX_RAW</name>
              <description>The raw interrupt status of SP exceeding the upper bound address of SP monitored region.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_EXCEPTION_MONITOR_RAW</name>
              <description>IBUS busy monitor interrupt status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_EXCEPTION_MONITOR_RAW</name>
              <description>DBUS busy monitor initerrupt status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_INTR_ENA</name>
          <description>core0 monitor interrupt enable register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_RD_INTR_ENA</name>
              <description>Core0 dram0 area0 read monitor interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_0_WR_INTR_ENA</name>
              <description>Core0 dram0 area0 write monitor interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_RD_INTR_ENA</name>
              <description>Core0 dram0 area1 read monitor interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_WR_INTR_ENA</name>
              <description>Core0 dram0 area1 write monitor interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_RD_INTR_ENA</name>
              <description>Core0 PIF area0 read monitor interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_WR_INTR_ENA</name>
              <description>Core0 PIF area0 write monitor interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_RD_INTR_ENA</name>
              <description>Core0 PIF area1 read monitor interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_WR_INTR_ENA</name>
              <description>Core0 PIF area1 write monitor interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MIN_INTR_ENA</name>
              <description>Core0 stackpoint underflow monitor interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MAX_INTR_ENA</name>
              <description>Core0 stackpoint overflow monitor interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_EXCEPTION_MONITOR_INTR_ENA</name>
              <description>IBUS busy monitor interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_EXCEPTION_MONITOR_INTR_ENA</name>
              <description>DBUS busy monitor interrupt enbale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_INTR_CLR</name>
          <description>core0 monitor interrupt clear register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_RD_CLR</name>
              <description>Write 1 to clear the interrupt for read operations in region 0 by Data bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_0_WR_CLR</name>
              <description>Write 1 to clear the interrupt for write operations in region 0 by Data bus.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_RD_CLR</name>
              <description>Write 1 to clear the interrupt for read operations in region 1 by Data bus.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_DRAM0_1_WR_CLR</name>
              <description>Write 1 to clear the interrupt for write operations in region 1 by Data bus.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_RD_CLR</name>
              <description>Write 1 to clear the interrupt for read operations in region 0 by Peripheral bus.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_0_WR_CLR</name>
              <description>Write 1 to clear the interrupt for write operations in region 0 by Peripheral bus.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_RD_CLR</name>
              <description>Write 1 to clear the interrupt for read operations in region 1 by Peripheral bus.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_0_AREA_PIF_1_WR_CLR</name>
              <description>Write 1 to clear the interrupt for write operations in region 1 by Peripheral bus.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MIN_CLR</name>
              <description>Write 1 to clear the interrupt for SP exceeding the lower bound address of SP monitored region.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_0_SP_SPILL_MAX_CLR</name>
              <description>Write 1 to clear the interrupt for SP exceeding the upper bound address of SP monitored region.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_EXCEPTION_MONITOR_CLR</name>
              <description>IBUS busy monitor interrupt clr</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_EXCEPTION_MONITOR_CLR</name>
              <description>DBUS busy monitor interrupt clr</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_DRAM0_0_MIN</name>
          <description>Configures lower boundary address of region 0 monitored on Data bus</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_MIN</name>
              <description>Configures the lower bound address of Data bus region 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_DRAM0_0_MAX</name>
          <description>Configures upper boundary address of region 0 monitored on Data bus</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_0_MAX</name>
              <description>Configures the upper bound address of Data bus region 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_DRAM0_1_MIN</name>
          <description>Configures lower boundary address of region 1 monitored on Data bus</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_1_MIN</name>
              <description>Configures the lower bound address of Data bus region 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_DRAM0_1_MAX</name>
          <description>Configures upper boundary address of region 1 monitored on Data bus</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_AREA_DRAM0_1_MAX</name>
              <description>Configures the upper bound address of Data bus region 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_PIF_0_MIN</name>
          <description>Configures lower boundary address of region 0 monitored on Peripheral bus</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CORE_0_AREA_PIF_0_MIN</name>
              <description>Configures the lower bound address of Peripheral bus region 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_PIF_0_MAX</name>
          <description>Configures upper boundary address of region 0 monitored on Peripheral bus</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_AREA_PIF_0_MAX</name>
              <description>Configures the upper bound address of Peripheral bus region 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_PIF_1_MIN</name>
          <description>Configures lower boundary address of region 1 monitored on Peripheral bus</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CORE_0_AREA_PIF_1_MIN</name>
              <description>Configures the lower bound address of Peripheral bus region 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_PIF_1_MAX</name>
          <description>Configures upper boundary address of region 1 monitored on Peripheral bus</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_AREA_PIF_1_MAX</name>
              <description>Configures the upper bound address of Peripheral bus region 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_PC</name>
          <description>Region monitoring HP CPU PC status register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_AREA_PC</name>
              <description>Represents the PC value when an interrupt is triggered during region monitoring.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_AREA_SP</name>
          <description>Region monitoring HP CPU SP status register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_AREA_SP</name>
              <description>Represents the SP value when an interrupt is triggered during region monitoring.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_SP_MIN</name>
          <description>Configures stack monitoring lower boundary address</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_SP_MIN</name>
              <description>Configures the lower bound address of SP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
