esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
        <register>
          <name>CORE_0_SP_MAX</name>
          <description>Configures stack monitoring upper boundary address</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CORE_0_SP_MAX</name>
              <description>Configures the upper bound address of SP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_SP_PC</name>
          <description>Stack monitoring HP CPU PC status register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_SP_PC</name>
              <description>Represents the PC value during stack monitoring.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_RCD_EN</name>
          <description>HP CPU PC logging enable register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_RCD_RECORDEN</name>
              <description>Configures whether to enable PC logging.\\
0: Disable\\
1: ASSIST_DEBUG_CORE_0_RCD_PDEBUGPC_REG starts to record PC in real time\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_0_RCD_PDEBUGEN</name>
              <description>Configures whether to enable HP CPU debugging.\\
0: Disable\\
1: HP CPU outputs PC\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_RCD_PDEBUGPC</name>
          <description>PC logging register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_RCD_PDEBUGPC</name>
              <description>Represents the PC value at HP CPU reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_RCD_PDEBUGSP</name>
          <description>PC logging register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_RCD_PDEBUGSP</name>
              <description>Represents SP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_IRAM0_EXCEPTION_MONITOR_0</name>
          <description>exception monitor status register0</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_IRAM0_RECORDING_ADDR_0</name>
              <description>reg_core_0_iram0_recording_addr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_RECORDING_WR_0</name>
              <description>reg_core_0_iram0_recording_wr_0</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_RECORDING_LOADSTORE_0</name>
              <description>reg_core_0_iram0_recording_loadstore_0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_IRAM0_EXCEPTION_MONITOR_1</name>
          <description>exception monitor status register1</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_IRAM0_RECORDING_ADDR_1</name>
              <description>reg_core_0_iram0_recording_addr_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_RECORDING_WR_1</name>
              <description>reg_core_0_iram0_recording_wr_1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_IRAM0_RECORDING_LOADSTORE_1</name>
              <description>reg_core_0_iram0_recording_loadstore_1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_0</name>
          <description>exception monitor status register2</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_WR_0</name>
              <description>reg_core_0_dram0_recording_wr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_RECORDING_BYTEEN_0</name>
              <description>reg_core_0_dram0_recording_byteen_0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_1</name>
          <description>exception monitor status register3</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_ADDR_0</name>
              <description>reg_core_0_dram0_recording_addr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_2</name>
          <description>exception monitor status register4</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_PC_0</name>
              <description>reg_core_0_dram0_recording_pc_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_3</name>
          <description>exception monitor status register5</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_WR_1</name>
              <description>reg_core_0_dram0_recording_wr_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DRAM0_RECORDING_BYTEEN_1</name>
              <description>reg_core_0_dram0_recording_byteen_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_4</name>
          <description>exception monitor status register6</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_ADDR_1</name>
              <description>reg_core_0_dram0_recording_addr_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DRAM0_EXCEPTION_MONITOR_5</name>
          <description>exception monitor status register7</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_DRAM0_RECORDING_PC_1</name>
              <description>reg_core_0_dram0_recording_pc_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_LASTPC_BEFORE_EXCEPTION</name>
          <description>cpu status register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_LASTPC_BEFORE_EXC</name>
              <description>Represents the PC of the last command before the HP CPU enters exception.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_DEBUG_MODE</name>
          <description>cpu status register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_0_DEBUG_MODE</name>
              <description>Represents whether RISC-V CPU (HP CPU) is in debugging mode.\\
1: In debugging mode\\
0: Not in debugging mode\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_0_DEBUG_MODULE_ACTIVE</name>
              <description>Represents the status of the RISC-V CPU (HP CPU) debug module.\\
1: Active status\\
Other: Inactive status\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_EXCEPTION_MONITOR_0</name>
          <description>exception monitor status register8</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_0</name>
              <description>reg_core_x_iram0_dram0_limit_cycle_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_EXCEPTION_MONITOR_1</name>
          <description>exception monitor status register9</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_1</name>
              <description>reg_core_x_iram0_dram0_limit_cycle_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Register clock control</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to enable the register clock gating. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2109130</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>version register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
