esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EFUSE</name>
      <description>eFuse Controller</description>
      <groupName>EFUSE</groupName>
      <baseAddress>0x600b4800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3d8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EFUSE</name>
        <value>14</value>
      </interrupt>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PGM_DATA%s</name>
          <description>Represents pgm_data%s</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PGM_DATA</name>
              <description>Configures the %sth 32-bit data to be programmed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PGM_CHECK_VALUE%s</name>
          <description>Represents pgm_check_value%s</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PGM_RS_DATA</name>
              <description>Configures the %sth RS code to be programmed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_WR_DIS0</name>
          <description>Represents rd_wr_dis</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WR_DIS</name>
              <description>Represents whether programming of individual eFuse memory bit is disabled or enabled.\\ 1: Disabled\\ 0: Enabled\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA0</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RD_DIS</name>
              <description>Represents whether reading of individual eFuse block(block4~block10) is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_ICACHE</name>
              <description>Represents whether cache is disabled.\\ 1: Disabled\\ 0: Enabled.\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_JTAG</name>
              <description>Represents whether the function of usb switch to jtag is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG</name>
              <description>Represents whether USB-Serial-JTAG is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_FORCE_DOWNLOAD</name>
              <description>Represents whether the function that forces chip into download mode is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DOWNLOAD_MSPI_DIS</name>
              <description>Represents whether SPI0 controller during boot_mode_download is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JTAG_SEL_ENABLE</name>
              <description>Represents whether the selection between usb_to_jtag and pad_to_jtag through strapping gpio15 when both EFUSE_DIS_PAD_JTAG and EFUSE_DIS_USB_JTAG are equal to 0 is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_PAD_JTAG</name>
              <description>Represents whether JTAG is disabled in the hard way(permanently).\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DOWNLOAD_MANUAL_ENCRYPT</name>
              <description>Represents whether flash encrypt function is disabled or enabled(except in SPI boot mode).\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_DREFH</name>
              <description>Represents the single-end input threhold vrefh of USB_SERIAL_JTAG PHY, 1.76 V to 2 V with step of 80 mV.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_DREFL</name>
              <description>Represents the single-end input threhold vrefl of USB_SERIAL_JTAG PHY, 1.76 V to 2 V with step of 80 mV.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_EXCHG_PINS</name>
              <description>Represents whether the D+ and D- pins of USB_SERIAL_JTAG PHY is exchanged.\\ 1: exchanged\\ 0: not exchanged\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDD_SPI_AS_GPIO</name>
              <description>Represents whether vdd spi pin is functioned as gpio.\\ 1: functioned\\ 0: not functioned\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_DELAY_SEL</name>
              <description>lp wdt timeout threshold at startup = initial timeout value * (2 ^ (EFUSE_WDT_DELAY_SEL + 1))</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_BOOT_CRYPT_CNT</name>
              <description>Represents whether SPI boot encrypt/decrypt is disabled or enabled.\\ Odd number of 1: enabled\\ Even number of 1: disabled\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE_0</name>
              <description>Represents whether revoking first secure boot key is enabled or disabled. 1. Enable\\ 0: Disable.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE_1</name>
              <description>Represents whether revoking second secure boot key is enabled or disabled. 1. Enable\\ 0: Disable.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE_2</name>
              <description>Represents whether revoking third secure boot key is enabled or disabled. 1. Enable\\ 0: Disable.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA1</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_PURPOSE_0</name>
              <description>Represents the purpose of Key0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_1</name>
              <description>Represents the purpose of Key1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_2</name>
              <description>Represents the purpose of Key2.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_3</name>
              <description>Represents the purpose of Key3.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_4</name>
              <description>Represents the purpose of Key4.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_5</name>
              <description>Represents the purpose of Key5.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC_DPA_LEVEL</name>
              <description>Represents the spa secure level by configuring the clock random divide mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_EN</name>
              <description>Represents whether secure boot is enabled or diabled. 1. Enable\\ 0: Disable.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_AGGRESSIVE_REVOKE</name>
              <description>Represents whether revoking aggressive secure boot is enabled or diabled. 1. Enable\\ 0: Disable.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_TPUW</name>
              <description>Represents the flash waiting time after power-up, in unit of ms. When the value less than 15, the waiting time is programmed value. Otherwise, the waiting time is 2 times the programmed value.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA2</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIS_DOWNLOAD_MODE</name>
              <description>Represents whether Download mode is disable or enable. 1. Disable\\ 0: Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DIRECT_BOOT</name>
              <description>Represents whether direct boot mode is disabled or enabled. 1. Disable\\ 0: Enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG_ROM_PRINT</name>
              <description>Represents whether print from USB-Serial-JTAG is disabled or enabled. 1. Disable\\ 0: Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE</name>
              <description>Represents whether the USB-Serial-JTAG download function is disabled or enabled.\\ 1: Disable\\ 0: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_SECURITY_DOWNLOAD</name>
              <description>Represents whether security download is enabled or disabled. 1: Enable\\ 0: Disable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PRINT_CONTROL</name>
              <description>Represents the types of UART printing.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_SEND_RESUME</name>
              <description>Represents whether ROM code is forced to send a resume commmand during SPI boot.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_VERSION</name>
              <description>Represents the version used by ESP-IDF anti-rollback feature.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_DISABLE_FAST_WAKE</name>
              <description>Represents whether FAST_VERIFY_ON_WAKE is disable or enable when Secure Boot is enable.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HYS_EN_PAD</name>
              <description>Set bits to enable hysteresis function of PAD0~27</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XTS_DPA_CLK_ENABLE</name>
              <description>Represents whether xts-aes anti-dpa attack clock is enabled.\\ 1. Enable.\\ 0: Disable.\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XTS_DPA_PSEUDO_LEVEL</name>
              <description>Represents the pseudo round level of xts-aes anti-dpa attack.\\ 3: High.\\ 2: Moderate 1. Low\\ 0: Disabled\\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_WIFI6</name>
              <description>Represents thether the WIFI6 feature is enable or disabled. 1: WIFI6 is disable, 0: WIFI6 is enabled.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECDSA_DISABLE_P192</name>
              <description>Represents whether to disable P192 curve in ECDSA. 1: Disabled. 0: Not disabled.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECC_FORCE_CONST_TIME</name>
              <description>Represents whether to force ecc to use const-time calculation mode. 1: Enable. 0: Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA3</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOOTLOADER_ANTI_ROLLBACK_SECURE_VERSION</name>
              <description>Represents the anti-rollback secure version of the 2nd stage bootloader used by the ROM bootloader.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOTLOADER_ANTI_ROLLBACK_EN</name>
              <description>Represents whether the ani-rollback check for the 2nd stage bootloader is enabled.\\1: Enabled\\0: Disabled\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOTLOADER_ANTI_ROLLBACK_UPDATE_IN_ROM</name>
              <description>Represents whether the ani-rollback SECURE_VERSION will be updated from the ROM bootloader.\\1: Enable\\0: Disable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECOVERY_BOOTLOADER_FLASH_SECTOR</name>
              <description>Represents the starting flash sector (flash sector size is 0x1000) of the recovery bootloader used by the ROM bootloader If the primary bootloader fails. 0 and 0xFFF - this feature is disabled.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA4</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RD_REPEAT_DATA4</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS0</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAC_0</name>
              <description>Represents MAC address. Low 32-bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS1</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAC_1</name>
              <description>Represents MAC address. High 16-bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAC_EXT</name>
              <description>Represents the extended bits of MAC address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS2</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAC_RESERVED_0</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAC_RESERVED_1</name>
              <description>Reserved.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS3</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAC_RESERVED_2</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_DATA_PART0_0</name>
              <description>Represents the first 14-bit of zeroth part of system data.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS4</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYS_DATA_PART0_1</name>
              <description>Represents the first 14-bit of zeroth part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS5</name>
          <description>Represents rd_mac_sys</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYS_DATA_PART0_2</name>
              <description>Represents the second 32-bit of zeroth part of system data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
