esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_GPIO</name>
      <description>Low-power General Purpose Input/Output</description>
      <groupName>LP_GPIO</groupName>
      <baseAddress>0x600b4400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OUT</name>
          <description>LP_GPIO output register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_ORIG</name>
              <description>Configures the output value of LP_GPIO0 ~ 6 output in simple LP_GPIO output mode.\\
0: Low level\\
1: High level\\
The value of bit0 ~ bit6 correspond to the output value of LP_GPIO0 ~ LP_GPIO6 respectively. Bit7 ~ bit31 are invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_W1TS</name>
          <description>LP_GPIO output set register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_W1TS</name>
              <description>Configures whether or not to set the output register LP_GPIO_OUT_REG of LP_GPIO0 ~ LP_GPIO6.\\
0: Not set\\
1: The corresponding bit in LP_GPIO_OUT_REG will be set to 1\\
Bit0 ~ bit6 are corresponding to LP_GPIO0 ~ LP_GPIO6. Bit7 ~ bit31 are invalid. \\
Recommended operation: use this register to set LP_GPIO_OUT_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_W1TC</name>
          <description>LP_GPIO output clear register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_W1TC</name>
              <description>Configures whether or not to clear the output register LP_GPIO_OUT_REG of LP_GPIO0 ~ LP_GPIO6 output.\\
0: Not clear\\
1: The corresponding bit in LP_GPIO_OUT_REG will be cleared.\\
Bit0 ~ bit6 are corresponding to LP_GPIO0 ~ LP_GPIO6. Bit7 ~ bit31 are invalid. \\
Recommended operation: use this register to clear LP_GPIO_OUT_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>LP_GPIO output enable register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Configures whether or not to enable the output of LP_GPIO0 ~ LP_GPIO6.\\
0: Not enable\\
1: Enable\\
Bit0 ~ bit6 are corresponding to LP_GPIO0 ~ LP_GPIO6. Bit7 ~ bit31 are invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE_W1TS</name>
          <description>LP_GPIO output enable set register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE_W1TS</name>
              <description>Configures whether or not to set the output enable register LP_GPIO_ENABLE_REG of LP_GPIO0 ~ LP_GPIO6.\\
0: Not set\\
1: The corresponding bit in LP_GPIO_ENABLE_REG will be set to 1\\
Bit0 ~ bit6 are corresponding to LP_GPIO0 ~ LP_GPIO6. Bit7 ~ bit31 are invalid. \\
Recommended operation: use this register to set LP_GPIO_ENABLE_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE_W1TC</name>
          <description>LP_GPIO output enable clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE_W1TC</name>
              <description>Configures whether or not to clear the output enable register LP_GPIO_ENABLE_REG of LP_GPIO0 ~ LP_GPIO6. \\
0: Not clear\\
1: The corresponding bit in LP_GPIO_ENABLE_REG will be cleared\\
Bit0 ~ bit6 are corresponding to LP_GPIO0 ~ LP_GPIO6. Bit7 ~ bit31 are invalid. \\
Recommended operation: use this register to clear LP_GPIO_ENABLE_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN</name>
          <description>LP_GPIO input register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_NEXT</name>
              <description>Represents the input value of LP_GPIO0 ~ LP_GPIO6. Each bit represents a pin input value:\\
0: Low level\\
1: High level\\
Bit0 ~ bit6 are corresponding to LP_GPIO0 ~ LP_GPIO6. Bit7 ~ bit31 are invalid.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>LP_GPIO interrupt status register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTERRUPT</name>
              <description>The interrupt status of LP_GPIO0 ~ LP_GPIO6, can be configured by the software. 

    - Bit0 ~ bit6 are corresponding to LP_GPIO0 ~ LP_GPIO6. Bit7 ~ bit31 are invalid. 
    - Each bit represents the status of its corresponding LP_GPIO:
    
        - 0: Represents the LP_GPIO does not generate the interrupt configured by LP_GPIO_PIN0_INT_TYPE, or this bit is configured to 0 by the software.
        - 1: Represents the LP_GPIO generates the interrupt configured by LP_GPIO_PIN0_INT_TYPE, or this bit is configured to 1 by the software.
    </description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_W1TS</name>
          <description>LP_GPIO interrupt status set register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_W1TS</name>
              <description>Configures whether or not to set the interrupt status register LP_GPIO_STATUS_INTERRUPT of LP_GPIO0 ~ LP_GPIO6. 

    - Bit0 ~ bit6 are corresponding to LP_GPIO0 ~ LP_GPIO6. Bit7 ~ bit31 are invalid. 
    - If the value 1 is written to a bit here, the corresponding bit in LP_GPIO_STATUS_INTERRUPT will be set to 1. \item Recommended operation: use this register to set LP_GPIO_STATUS_INTERRUPT. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_W1TC</name>
          <description>LP_GPIO interrupt status clear register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_W1TC</name>
              <description>Configures whether or not to clear the interrupt status register LP_GPIO_STATUS_INTERRUPT of LP_GPIO0 ~ LP_GPIO6. 

    - Bit0 ~ bit6 are corresponding to LP_GPIO0 ~ LP_GPIO6. Bit7 ~ bit31 are invalid. 
    - If the value 1 is written to a bit here, the corresponding bit in LP_GPIO_STATUS_INTERRUPT will be cleared. \item Recommended operation: use this register to clear LP_GPIO_STATUS_INTERRUPT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_NEXT</name>
          <description>LP_GPIO interrupt source register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_INTERRUPT_NEXT</name>
              <description>Represents the interrupt source signal of LP_GPIO0 ~ LP_GPIO6.\\
Bit0 ~ bit24 are corresponding to LP_GPIO0 ~ LP_GPIO6. Bit7 ~ bit31 are invalid. Each bit represents:\\
0: The LP_GPIO does not generate the interrupt configured by LP_GPIO_PIN0_INT_TYPE.\\
1: The LP_GPIO generates an interrupt configured by LP_GPIO_PIN0_INT_TYPE.\\
The interrupt could be rising edge interrupt, falling edge interrupt, level sensitive interrupt and any edge interrupt.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>7</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PIN%s</name>
          <description>LP_GPIO%s configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize LP_GPIO input data on either edge of LP IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select pin drive mode. \\
0: Normal output\\
1: Open drain output \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize LP_GPIO input data on either edge of LP IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_WAKEUP_CLR</name>
              <description>LP_GPIO wakeup clear register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures LP_GPIO interrupt type.\\
0: LP_GPIO interrupt disabled\\
1: Rising edge trigger\\
2: Falling edge trigger\\
3: Any edge trigger\\
4: Low level trigger\\
5: High level trigger\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable LP_GPIO wake-up function.\\
0: Disable\\
1: Enable\\
This function only wakes up the CPU from Light-sleep. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>7</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_OUT_SEL_CFG</name>
          <description>Configuration register for LP_GPIO%s output</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FUNC_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>LP_GPIO clock gate register</description>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether or not to enable clock gate.\\
0: Not enable\\
1: Enable, the clock is free running. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>LP_GPIO version register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2310240</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
