esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MEM_MONITOR</name>
      <description>MEM_MONITOR Peripheral</description>
      <groupName>MEM_MONITOR</groupName>
      <baseAddress>0x60092000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LOG_SETTING</name>
          <description>Bus access logging configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x10</resetValue>
          <fields>
            <field>
              <name>LOG_MODE</name>
              <description>Configures monitoring modes.bit[0]: Configures write monitoring. \\
0: Disable \\
1: Enable\\
bit[1]: Configures word monitoring. \\
0: Disable \\
1: Enable\\
bit[2]: Configures halfword monitoring. \\
0: Disable \\
1: Enable\\
bit[3]: Configures byte monitoring. \\
0: Disable \\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOG_MEM_LOOP_ENABLE</name>
              <description>Configures the writing mode for recorded data.1: Loop mode\\
0: Non-loop mode\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOG_CORE_ENA</name>
              <description>Configures whether to enable  CPU bus access logging.bit[0]: Configures whether to enable HP CPU bus access logging. \\
0: Disable \\
1: Enable\\
Bit[7:1]: Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOG_DMA_0_ENA</name>
              <description>Configures whether to enable  DMA_0 bus access logging.bit[0]: Configures whether to enable DMA_0 bus access logging. \\
0: Disable \\
1: Enable\\
Bit[7:1]: Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOG_DMA_1_ENA</name>
              <description>Configures whether to enable  DMA_1 bus access logging.bit[0]: Configures whether to enable DMA_1 bus access logging. \\
0: Disable \\
1: Enable\\
Bit[7:1]: Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_SETTING1</name>
          <description>Bus access logging configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_DMA_2_ENA</name>
              <description>Configures whether to enable  DMA_2 bus access logging.bit[0]: Configures whether to enable DMA_2 bus access logging. \\
0: Disable \\
1: Enable\\
Bit[7:1]: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOG_DMA_3_ENA</name>
              <description>Configures whether to enable  DMA_3 bus access logging.bit[0]: Configures whether to enable DMA_3 bus access logging. \\
0: Disable \\
1: Enable\\
Bit[7:1]: Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_CHECK_DATA</name>
          <description>Configures monitored data in Bus access logging</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_CHECK_DATA</name>
              <description>Configures the data to be monitored during bus accessing.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_DATA_MASK</name>
          <description>Configures masked data in Bus access logging</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_DATA_MASK</name>
              <description>Configures which byte(s) in MEM_MONITOR_LOG_CHECK_DATA_REG to mask.bit[0]: Configures whether to mask the least significant byte of  MEM_MONITOR_LOG_CHECK_DATA_REG.\\
0: Not mask \\
1: Mask\\
bit[1]: Configures whether to mask the second least significant byte of  MEM_MONITOR_LOG_CHECK_DATA_REG. \\
0: Not mask \\
1: Mask\\
bit[2]: Configures whether to mask the second most significant byte of  MEM_MONITOR_LOG_CHECK_DATA_REG. \\
0: Not mask \\
1: Mask\\
bit[3]: Configures whether to mask the most significant byte of  MEM_MONITOR_LOG_CHECK_DATA_REG. \\
0: Not mask \\
1: Mask\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MIN</name>
          <description>Configures monitored address space in Bus access logging</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_MIN</name>
              <description>Configures the lower bound address of the monitored address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MAX</name>
          <description>Configures monitored address space in Bus access logging</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_MAX</name>
              <description>Configures the upper bound address of the monitored address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MON_ADDR_UPDATE_0</name>
          <description>Configures the address space of from MEM_MONITOR_LOG_MIN_REG to MEM_MONITOR_LOG_MAX_REG as the monitored address space of the certain master.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_MON_ADDR_CORE_UPDATE</name>
              <description>Configures the monitored address space of the certain master. Bit[0]: Configures the address space of from MEM_MONITOR_LOG_MIN_REG to MEM_MONITOR_LOG_MAX_REG as the monitored address space of the HP CPU bus.1: Update\\
0: Not update\\
Bit[7:1]: Reserved\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOG_MON_ADDR_ALL_UPDATE</name>
              <description>Configures the address space of from MEM_MONITOR_LOG_MIN_REG to MEM_MONITOR_LOG_MAX_REG as the monitored address space of all masters.1: Update\\
0: Not update\\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MON_ADDR_UPDATE_1</name>
          <description>Configures the address space of from MEM_MONITOR_LOG_MIN_REG to MEM_MONITOR_LOG_MAX_REG as the monitored address space of the certain master.</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_MON_ADDR_DMA_0_UPDATE</name>
              <description>Configures the monitored address space of the certain master. Bit[0]: Configures the address space of from MEM_MONITOR_LOG_MIN_REG to MEM_MONITOR_LOG_MAX_REG as the monitored address space of the DMA_0 bus.1: Update\\
0: Not update\\
Bit[7:1]: Reserved\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOG_MON_ADDR_DMA_1_UPDATE</name>
              <description>Configures the monitored address space of the certain master. Bit[0]: Configures the address space of from MEM_MONITOR_LOG_MIN_REG to MEM_MONITOR_LOG_MAX_REG as the monitored address space of the DMA_1 bus.1: Update\\
0: Not update\\
Bit[7:1]: Reserved\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOG_MON_ADDR_DMA_2_UPDATE</name>
              <description>Configures the monitored address space of the certain master. Bit[0]: Configures the address space of from MEM_MONITOR_LOG_MIN_REG to MEM_MONITOR_LOG_MAX_REG as the monitored address space of the DMA_2 bus.1: Update\\
0: Not update\\
Bit[7:1]: Reserved\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOG_MON_ADDR_DMA_3_UPDATE</name>
              <description>Configures the monitored address space of the certain master. Bit[0]: Configures the address space of from MEM_MONITOR_LOG_MIN_REG to MEM_MONITOR_LOG_MAX_REG as the monitored address space of the DMA_3 bus.1: Update\\
0: Not update\\
Bit[7:1]: Reserved\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MEM_START</name>
          <description>Configures the starting address of the storage memory for recorded data</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_MEM_START</name>
              <description>Configures the starting address of the storage space for recorded data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MEM_END</name>
          <description>Configures the end address of the storage memory for recorded data</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_MEM_END</name>
              <description>Configures the ending address of the storage space for recorded data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MEM_CURRENT_ADDR</name>
          <description>Represents the address for the next write</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_MEM_CURRENT_ADDR</name>
              <description>Represents the address of the next write.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MEM_ADDR_UPDATE</name>
          <description>Updates the address for the next write with the starting address for the recorded data</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_MEM_ADDR_UPDATE</name>
              <description>Configures whether to update the value in MEM_MONITOR_LOG_MEM_START_REG to MEM_MONITOR_LOG_MEM_CURRENT_ADDR_REG.\raggedright1: Update \\
0: Not update (default) \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOG_MEM_FULL_FLAG</name>
          <description>Logging overflow status register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOG_MEM_FULL_FLAG</name>
              <description>Represents whether data overflows the storage space.0: Not Overflow\\
1: Overflow\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR_LOG_MEM_FULL_FLAG</name>
              <description>Configures whether to clear the  MEM_MONITOR_LOG_MEM_FULL_FLAG flag bit.0: Not clear\\
1: Clear\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Register clock control</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to enable the register clock gating.0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2308140</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
