esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
        <register>
          <name>PVT_MONITOR_FUNC_CLK_CONF</name>
          <description>PVT_MONITOR function clock configuration register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the pvt_monitor function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_SEL</name>
              <description>Configures the clock source of PVT MONITER.\\
0 (default): XTAL_CLK\\
1: PLL_F160M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_EN</name>
              <description>Set 1 to enable source clock of pvt sitex</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDMA_CONF</name>
          <description>GDMA configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>GDMA_CLK_EN</name>
              <description>Set 1 to enable gdma clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GDMA_RST_EN</name>
              <description>Set 1 to reset gdma module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2_CONF</name>
          <description>SPI2 configuration register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>SPI2_CLK_EN</name>
              <description>Set 1 to enable spi2 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_RST_EN</name>
              <description>Set 1 to reset spi2 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_READY</name>
              <description>Query this field after reset spi2 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2_CLKM_CONF</name>
          <description>SPI2_CLKM configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>SPI2_CLKM_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the spi2_mst clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_CLKM_SEL</name>
              <description>Configures the clock source of SPI2.\\
0 (default): XTAL_CLK\\
1: PLL_F160M_CLK\\
2: RC_FAST_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_CLKM_EN</name>
              <description>Set 1 to enable spi2 function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_CONF</name>
          <description>AES configuration register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>AES_CLK_EN</name>
              <description>Set 1 to enable aes clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_RST_EN</name>
              <description>Set 1 to reset aes module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_READY</name>
              <description>Query this field after reset aes module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_CONF</name>
          <description>SHA configuration register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>SHA_CLK_EN</name>
              <description>Set 1 to enable sha clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_RST_EN</name>
              <description>Set 1 to reset sha module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_READY</name>
              <description>Query this field after reset sha module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_CONF</name>
          <description>RSA configuration register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>RSA_CLK_EN</name>
              <description>Set 1 to enable rsa clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_RST_EN</name>
              <description>Set 1 to reset rsa module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_READY</name>
              <description>Query this field after reset rsa module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_PD_CTRL</name>
          <description>RSA power control register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>RSA_MEM_PD</name>
              <description>Set this bit to power down rsa internal memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_MEM_FORCE_PU</name>
              <description>Set this bit to force power up rsa internal memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_MEM_FORCE_PD</name>
              <description>Set this bit to force power down rsa internal memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_CONF</name>
          <description>ECC configuration register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>ECC_CLK_EN</name>
              <description>Set 1 to enable ecc clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_RST_EN</name>
              <description>Set 1 to reset ecc module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_READY</name>
              <description>Query this field after reset ecc module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PD_CTRL</name>
          <description>ECC power control register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>ECC_MEM_PD</name>
              <description>Set this bit to power down ecc internal memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_MEM_FORCE_PU</name>
              <description>Set this bit to force power up ecc internal memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_MEM_FORCE_PD</name>
              <description>Set this bit to force power down ecc internal memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DS_CONF</name>
          <description>DS configuration register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>DS_CLK_EN</name>
              <description>Set 1 to enable ds clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS_RST_EN</name>
              <description>Set 1 to reset ds module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS_READY</name>
              <description>Query this field after reset ds module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HMAC_CONF</name>
          <description>HMAC configuration register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>HMAC_CLK_EN</name>
              <description>Set 1 to enable hmac clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HMAC_RST_EN</name>
              <description>Set 1 to reset hmac module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HMAC_READY</name>
              <description>Query this field after reset hmac module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECDSA_CONF</name>
          <description>ECDSA configuration register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>ECDSA_CLK_EN</name>
              <description>Set 1 to enable ecdsa clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECDSA_RST_EN</name>
              <description>Set 1 to reset ecdsa module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECDSA_READY</name>
              <description>Query this field after reset ecdsa module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOMUX_CONF</name>
          <description>IOMUX configuration register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>IOMUX_CLK_EN</name>
              <description>Set 1 to enable iomux apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOMUX_RST_EN</name>
              <description>Set 1 to reset iomux module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IOMUX_CLK_CONF</name>
          <description>IOMUX_CLK configuration register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>IOMUX_FUNC_CLK_SEL</name>
              <description>Configures the clock source of IO MUX.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F80M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOMUX_FUNC_CLK_EN</name>
              <description>Set 1 to enable iomux function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCM_MEM_MONITOR_CONF</name>
          <description>TCM_MEM_MONITOR configuration register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>TCM_MEM_MONITOR_CLK_EN</name>
              <description>Set 1 to enable tcm_mem_monitor clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCM_MEM_MONITOR_RST_EN</name>
              <description>Set 1 to reset tcm_mem_monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCM_MEM_MONITOR_READY</name>
              <description>Query this field after reset tcm_mem_monitor module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_MEM_MONITOR_CONF</name>
          <description>PSRAM_MEM_MONITOR configuration register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>PSRAM_MEM_MONITOR_CLK_EN</name>
              <description>Set 1 to enable psram_mem_monitor clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MEM_MONITOR_RST_EN</name>
              <description>Set 1 to reset psram_mem_monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MEM_MONITOR_READY</name>
              <description>Query this field after reset psram_mem_monitor module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACE_CONF</name>
          <description>TRACE configuration register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>TRACE_CLK_EN</name>
              <description>Set 1 to enable trace clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACE_RST_EN</name>
              <description>Set 1 to reset trace module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIST_CONF</name>
          <description>ASSIST configuration register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>ASSIST_CLK_EN</name>
              <description>Set 1 to enable assist clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASSIST_RST_EN</name>
              <description>Set 1 to reset assist module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_CONF</name>
          <description>CACHE configuration register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CACHE_CLK_EN</name>
              <description>Set 1 to enable cache clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_RST_EN</name>
              <description>Set 1 to reset cache module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_PD_CTRL</name>
          <description>CACHE power control register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>CACHE_MEM_FORCE_PU</name>
              <description>Set this bit to force power down CACHE memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_MEM_FORCE_PD</name>
              <description>Set this bit to force power up CACHE memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_CONF</name>
          <description>MODEM_APB configuration register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>MODEM_APB_CLK_EN</name>
              <description>This field indicates if modem_apb clock is enable. 0: disable, 1: enable(default).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_RST_EN</name>
              <description>Set this file as 1 to reset modem-subsystem.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_CLK_EN</name>
              <description>This field indicates if modem source clock is enable. 0: disable, 1: enable(default).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
