esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
        <register>
          <name>TIMEOUT_CONF</name>
          <description>TIMEOUT configuration register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_TIMEOUT_RST_EN</name>
              <description>Set 1 to reset cpu_peri timeout module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_TIMEOUT_RST_EN</name>
              <description>Set 1 to reset hp_peri timeout module and hp_modem timeout module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCLK_CONF</name>
          <description>SYSCLK configuration register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0xa8000200</resetValue>
          <fields>
            <field>
              <name>LS_DIV_NUM</name>
              <description>clk_hproot is div1 of low-speed clock-source if clck-source is a low-speed clock-source such as XTAL/FOSC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_DIV_NUM</name>
              <description>clk_hproot is div3 of SPLL if the clock-source is high-speed clock SPLL.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_CLK_SEL</name>
              <description>Configures to select the clock source of HP_ROOT_CLK.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F160M_CLK\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_XTAL_FREQ</name>
              <description>This field indicates the frequency(MHz) of XTAL.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_DBGMD_CLK_EN</name>
              <description>This field indicates if cpu debug mode clock is enable. 0: disable, 1: enable(default).</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_WAITI_CONF</name>
          <description>CPU_WAITI configuration register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0xd</resetValue>
          <fields>
            <field>
              <name>CPUPERIOD_SEL</name>
              <description>Reserved. This filed has been replaced by PCR_CPU_DIV_NUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_FREQ_SEL</name>
              <description>Reserved. This filed has been replaced by PCR_CPU_DIV_NUM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_WAIT_MODE_FORCE_ON</name>
              <description>Set 1 to force cpu_waiti_clk enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_WAITI_DELAY_NUM</name>
              <description>This field used to set delay cycle when cpu enter waiti mode, after delay waiti_clk will close</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_FREQ_CONF</name>
          <description>CPU_FREQ configuration register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_DIV_NUM</name>
              <description>Set this field to generate clk_cpu drived by clk_hproot. The clk_cpu is div1(default)/div2/div4 of clk_hproot. This field is only avaliable for low-speed clock-source such as XTAL/FOSC, and should be used together with PCR_AHB_DIV_NUM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_FREQ_CONF</name>
          <description>AHB_FREQ configuration register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_DIV_NUM</name>
              <description>Set this field to generate clk_ahb drived by clk_hproot. The clk_ahb is div1(default)/div2/div4/div8 of clk_hproot. This field is only avaliable for low-speed clock-source such as XTAL/FOSC, and should be used together with PCR_CPU_DIV_NUM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FREQ_CONF</name>
          <description>APB_FREQ configuration register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB_DECREASE_DIV_NUM</name>
              <description>If this field's value is grater than PCR_APB_DIV_NUM, the clk_apb will be automatically down to clk_apb_decrease only when no access is on apb-bus, and will recover to the previous frequency when a new access appears on apb-bus. Set as one within (0,1,3) to set clk_apb_decrease as div1/div2/div4(default) of clk_ahb. Note that enable this function will reduce performance. Users can set this field as zero to disable the auto-decrease-apb-freq function. By default, this function is disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB_DIV_NUM</name>
              <description>Set as one within (0,1,3) to generate clk_apb drived by clk_ahb. The clk_apb is div1(default)/div2/div4 of clk_ahb.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCLK_FREQ_QUERY_0</name>
          <description>SYSCLK frequency query 0 register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x6008</resetValue>
          <fields>
            <field>
              <name>FOSC_FREQ</name>
              <description>This field indicates the frequency(MHz) of FOSC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_FREQ</name>
              <description>This field indicates the frequency(MHz) of SPLL.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_DIV_CLK_EN</name>
          <description>SPLL DIV clock-gating configuration register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x1fe</resetValue>
          <fields>
            <field>
              <name>PLL_160M_CLK_EN</name>
              <description>This field is used to open 160 MHz clock (div3 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_120M_CLK_EN</name>
              <description>This field is used to open 120 MHz clock (div4 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_80M_CLK_EN</name>
              <description>This field is used to open 80 MHz clock (div6  of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_60M_CLK_EN</name>
              <description>This field is used to open 60 MHz clock (div8 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_48M_CLK_EN</name>
              <description>This field is used to open 48 MHz clock (div10 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_40M_CLK_EN</name>
              <description>This field is used to open 40 MHz clock (div12 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_20M_CLK_EN</name>
              <description>This field is used to open 20 MHz clock (div24 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_12M_CLK_EN</name>
              <description>This field is used to open 12 MHz clock (div40 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_CLK_OUT_EN</name>
          <description>CLK_OUT_EN configuration register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0x3ff</resetValue>
          <fields>
            <field>
              <name>CLK20_OEN</name>
              <description>Set 1 to enable 20m clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK22_OEN</name>
              <description>Set 1 to enable 22m clock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK44_OEN</name>
              <description>Set 1 to enable 44m clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_BB_OEN</name>
              <description>Set 1 to enable bb clock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK80_OEN</name>
              <description>Set 1 to enable 80m clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK160_OEN</name>
              <description>Set 1 to enable 160m clock</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_320M_OEN</name>
              <description>Set 1 to enable 320m clock</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_ADC_INF_OEN</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DAC_CPU_OEN</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_XTAL_OEN</name>
              <description>Set 1 to enable xtal clock</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_32K_CONF</name>
          <description>32KHz clock configuration register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0x700</resetValue>
          <fields>
            <field>
              <name>_32K_SEL</name>
              <description>Configures the 32KHz clock for TIMER_GROUP.\\
0 (default): RC32K_CLK\\
1: XTAL32K_CLK\\
2: OSC_SLOW_CLK\\
3: RC_SLOW_CLK\\
4: RC_FAST_CLK\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FOSC_TICK_NUM</name>
              <description>When PCR_32K_SEL set as 4, This field PCR_FOSC_TICK_NUM is used to set the divider number of fosc.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM_POWER_CONF_0</name>
          <description>HP SRAM/ROM configuration register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>ROM_FORCE_PU</name>
              <description>Set this bit to force power up ROM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM_FORCE_PD</name>
              <description>Set this bit to force power down ROM.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM_CLKGATE_FORCE_ON</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the ROM. 0: A gate-clock will be used when accessing the ROM.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM_POWER_CONF_1</name>
          <description>HP SRAM/ROM configuration register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0x1f</resetValue>
          <fields>
            <field>
              <name>SRAM_FORCE_PU</name>
              <description>Set this bit to force power up SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM_FORCE_PD</name>
              <description>Set this bit to force power down SRAM.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM_CLKGATE_FORCE_ON</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the SRAM. 0: A gate-clock will be used when accessing the SRAM.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_CONF</name>
          <description>Clock source configuration register for External Memory Encryption and Decryption</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEC_CLK_SEL</name>
              <description>Configures the clock source for the External Memory Encryption and Decryption module.\\
0(default): XTAL_CLK\\
1 RC_FAST_CLK\\
2: PLL_F480M_CLK\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_RST_EN</name>
              <description>Set 1 to reset sec module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DAC_INV_PHASE_CONF</name>
          <description>xxxx</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_RX_ADC_INV_PHASE_ENA</name>
              <description>xxxx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_TX_DAC_INV_PHASE_ENA</name>
              <description>xxxx</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_CLK_UPDATE</name>
          <description>Configuration register for applying updated high-performance system clock sources</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUS_CLOCK_UPDATE</name>
              <description>Configures whether or not to update configurations for CPU_CLK division, AHB_CLK division and HP_ROOT_CLK clock source selection.\\
0: Not update configurations\\
1: Update configurations\\
This bit is automatically cleared when configurations have been updated.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_CLK_DIV</name>
          <description>SAR ADC clock divisor configuration register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0x404</resetValue>
          <fields>
            <field>
              <name>SAR2_CLK_DIV_NUM</name>
              <description>Configures the divisor for SAR ADC 2  clock to generate ADC analog control signals.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_CLK_DIV_NUM</name>
              <description>Configures the divisor for SAR ADC 1  clock to generate ADC analog control signals.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWDET_SAR_CLK_CONF</name>
          <description>xxxx</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0x107</resetValue>
          <fields>
            <field>
              <name>PWDET_SAR_CLK_DIV_NUM</name>
              <description>xxxx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWDET_SAR_CLK_EN</name>
              <description>xxxx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP_WDT_CONF</name>
          <description>TIMERGROUP_WDT configuration register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TG0_WDT_RST_EN</name>
              <description>Set 1 to reset timer_group0 wdt module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_WDT_RST_EN</name>
              <description>Set 1 to reset timer_group1 wdt module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
