esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
        <register>
          <name>TIMERGROUP_XTAL_CONF</name>
          <description>TIMERGROUP1 configuration register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>TG0_XTAL_RST_EN</name>
              <description>Set 1 to reset timer_group0 xtal clock domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_XTAL_RST_EN</name>
              <description>Set 1 to reset timer_group1 xtal clock domain</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_XTAL_CLK_EN</name>
              <description>Set 1 to enable tg0 xtal clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET_EVENT_BYPASS</name>
          <description>reset event bypass backdoor configuration register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>APM</name>
              <description>This field is used to control reset event relationship for tee_reg/apm_reg/hp_system_reg. 1: tee_reg/apm_reg/hp_system_reg will only be reset by power-reset. some reset event will be bypass. 0: tee_reg/apm_reg/hp_system_reg will not only be reset by power-reset, but also some reset event.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_EVENT_BYPASS</name>
              <description>This field is used to control reset event relationship for system-bus. 1: system bus (including arbiter/router) will only be reset by power-reset. some reset event will be bypass. 0: system bus (including arbiter/router) will not only be reset by power-reset, but also some reset event.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGDMA_CONF</name>
          <description>REGDMA configuration register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REGDMA_CLK_EN</name>
              <description>Set 1 to enable regdma clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_RST_EN</name>
              <description>Set 1 to reset regdma module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_CONF</name>
          <description>ETM configuration register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>ETM_CLK_EN</name>
              <description>Set 1 to enable etm clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_RST_EN</name>
              <description>Set 1 to reset etm module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_READY</name>
              <description>Query this field after reset etm module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_SLAVE_CONF</name>
          <description>SDIO_SLAVE configuration register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>SDIO_SLAVE_CLK_EN</name>
              <description>Set 1 to enable sdio_slave clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_SLAVE_RST_EN</name>
              <description>Set 1 to reset sdio_slave module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_SLAVE_PD_CTRL</name>
          <description>LEDC power control register</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>SDIO_MEM_FORCE_PU</name>
              <description>Set this bit to force power down SDIO memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_MEM_FORCE_PD</name>
              <description>Set this bit to force power up SDIO memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPGA_DEBUG</name>
          <description>fpga debug register</description>
          <addressOffset>0xff4</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>FPGA_DEBUG</name>
              <description>Only used in fpga debug.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>PCR clock gating configure register</description>
          <addressOffset>0xff8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Set this bit as 1 to force on clock gating.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Date register.</description>
          <addressOffset>0xffc</addressOffset>
          <size>32</size>
          <resetValue>0x2412290</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>PCR version information.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
