esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
        <register>
          <name>MEM_NAND_FLASH_CFG_DATA0</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_NAND_FLASH_CFG_DATA0</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_CFG_DATA1</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_NAND_FLASH_CFG_DATA1</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_NAND_FLASH_CFG_DATA2</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_CFG_DATA3</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_NAND_FLASH_CFG_DATA2</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_NAND_FLASH_CFG_DATA4</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_CFG_DATA5</name>
              <description>configure data for SPI SEQ din/dout need. The data could be use to configure NAND FLASH or compare read data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_NAND_FLASH_CMD_LUT0</name>
          <description>MSPI NAND FLASH CMD LUT control register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_NAND_FLASH_LUT_CMD_VALUE0</name>
              <description>MSPI NAND FLASH config cmd value at cmd lut address 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_LUT_SFSM_ST_EN0</name>
              <description>MSPI NAND FLASH config sfsm_st_en at cmd lut address 0.[3]-ADDR period enable; [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_LUT_CMD_LEN0</name>
              <description>MSPI NAND FLASH config cmd length at cmd lut address 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_LUT_ADDR_LEN0</name>
              <description>MSPI NAND FLASH config address length at cmd lut address 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_LUT_DATA_LEN0</name>
              <description>MSPI NAND FLASH config data length at cmd lut address 0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_LUT_BUS_EN0</name>
              <description>MSPI NAND FLASH config spi_bus_en at cmd lut address 0,SPI could use DUAL/QUAD mode while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT0_REG's field. The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_NAND_FLASH_SPI_SEQ0</name>
          <description>NAND FLASH SPI SEQ control register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_NAND_FLASH_SEQ_TAIL_FLG0</name>
              <description>MSPI NAND FLASH config seq_tail_flg at spi seq index 0.1: The last index for sequence. 0: Not the last index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_SR_CHK_EN0</name>
              <description>MSPI NAND FLASH config sr_chk_en at spi seq index 0. 1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_DIN_INDEX0</name>
              <description>MSPI NAND FLASH config din_index at spi seq index 0.  Use with SPI_MEM_NAND_FLASH_CFG_DATA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_ADDR_INDEX0</name>
              <description>MSPI NAND FLASH config addr_index at spi seq index 0.  Use with SPI_MEM_NAND_FLASH_SR_ADDR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_REQ_OR_CFG0</name>
              <description>MSPI NAND FLASH config reg_or_cfg at spi seq index 0. 1: AXI/APB request  0: SPI SEQ configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_NAND_FLASH_CMD_INDEX0</name>
              <description>MSPI NAND FLASH config spi_cmd_index at spi seq index 0. Use to find SPI command in CMD LUT.(Note these registers are described to indicate the SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined by the user, but cannot exceed 16 )</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_XTS_PLAIN_BASE</name>
          <description>The base address of the memory that stores plaintext in Manual Encryption</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XTS_PLAIN</name>
              <description>This field is only used to generate include file in c case. This field is useless. Please do not use this field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_XTS_LINESIZE</name>
          <description>Manual Encryption Line-Size register</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XTS_LINESIZE</name>
              <description>This bits stores the line-size parameter which will be used in manual encryption calculation. It decides how many bytes will be encrypted one time. 0: 16-bytes, 1: 32-bytes, 2: 64-bytes, 3:reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_XTS_DESTINATION</name>
          <description>Manual Encryption destination register</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XTS_DESTINATION</name>
              <description>This bit stores the destination parameter which will be used in manual encryption calculation. 0: flash(default), 1: psram(reserved). Only default value can be used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_XTS_PHYSICAL_ADDRESS</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XTS_PHYSICAL_ADDRESS</name>
              <description>This bits stores the physical-address parameter which will be used in manual encryption calculation. This value should aligned with byte number decided by line-size parameter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_XTS_TRIGGER</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x34c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XTS_TRIGGER</name>
              <description>Set this bit to trigger the process of manual encryption calculation. This action should only be asserted when manual encryption status is 0. After this action, manual encryption status becomes 1. After calculation is done, manual encryption status becomes 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_XTS_RELEASE</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XTS_RELEASE</name>
              <description>Set this bit to release encrypted result to mspi. This action should only be asserted when manual encryption status is 2. After this action, manual encryption status will become 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_XTS_DESTROY</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XTS_DESTROY</name>
              <description>Set this bit to destroy encrypted result. This action should be asserted only when manual encryption status is 3. After this action, manual encryption status will become 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_XTS_STATE</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XTS_STATE</name>
              <description>This bits stores the status of manual encryption. 0: idle, 1: busy of encryption calculation, 2: encryption calculation is done but the encrypted result is invisible to mspi, 3: the encrypted result is visible to mspi.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_XTS_DATE</name>
          <description>Manual Encryption version register</description>
          <addressOffset>0x35c</addressOffset>
          <size>32</size>
          <resetValue>0x20210907</resetValue>
          <fields>
            <field>
              <name>XTS_DATE</name>
              <description>This bits stores the last modified-time of manual encryption feature.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_MMU_ITEM_CONTENT</name>
          <description>MSPI-MMU item content register</description>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <resetValue>0x37c</resetValue>
          <fields>
            <field>
              <name>MMU_ITEM_CONTENT</name>
              <description>MSPI-MMU item content</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_MMU_ITEM_INDEX</name>
          <description>MSPI-MMU item index register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MMU_ITEM_INDEX</name>
              <description>MSPI-MMU item index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_MMU_POWER_CTRL</name>
          <description>MSPI MMU power control register</description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <resetValue>0x13200004</resetValue>
          <fields>
            <field>
              <name>MMU_MEM_FORCE_ON</name>
              <description>Set this bit to enable mmu-memory clock force on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MMU_MEM_FORCE_PD</name>
              <description>Set this bit to force mmu-memory powerdown</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MMU_MEM_FORCE_PU</name>
              <description>Set this bit to force mmu-memory powerup, in this case, the power should also be controlled by rtc.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MMU_PAGE_SIZE</name>
              <description>0: Max page size , 1: Max page size/2 , 2: Max page size/4, 3: Max page size/8</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_AUX_CTRL</name>
              <description>MMU PSRAM aux control register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_RDN_ENA</name>
              <description>ECO register enable bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_RDN_RESULT</name>
              <description>MSPI module clock domain and AXI clock domain ECO register result register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_DPA_CTRL</name>
          <description>SPI memory cryption DPA register</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <resetValue>0xf</resetValue>
          <fields>
            <field>
              <name>CRYPT_SECURITY_LEVEL</name>
              <description>Set the security level of spi mem cryption. 0: Shut off cryption DPA funtion. 1-7: The bigger the number is, the more secure the cryption is. (Note that the performance of cryption will decrease together with this number increasing)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPT_CALC_D_DPA_EN</name>
              <description>Only available when SPI_CRYPT_SECURITY_LEVEL is not 0. 1: Enable DPA in the calculation that using key 1 or key 2. 0: Enable DPA only in the calculation that using key 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPT_DPA_SELECT_REGISTER</name>
              <description>1: MSPI XTS DPA clock gate is controlled by SPI_CRYPT_CALC_D_DPA_EN and SPI_CRYPT_SECURITY_LEVEL. 0: Controlled by efuse bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_XTS_PSEUDO_ROUND_CONF</name>
          <description>SPI memory cryption PSEUDO register</description>
          <addressOffset>0x38c</addressOffset>
          <size>32</size>
          <resetValue>0x45c</resetValue>
          <fields>
            <field>
              <name>MEM_MODE_PSEUDO</name>
              <description>Set the mode of pseudo. 2'b00: crypto without pseudo. 2'b01: state T with pseudo and state D without pseudo. 2'b10: state T with pseudo and state D with few pseudo. 2'b11: crypto with pseudo.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_PSEUDO_RNG_CNT</name>
              <description>xts aes peseudo function base round that must be peformed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_PSEUDO_BASE</name>
              <description>xts aes peseudo function base round that must be peformed.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_PSEUDO_INC</name>
              <description>xts aes peseudo function increment round that will be peformed randomly between 0 &amp; 2**(inc+1).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_REGISTERRND_ECO_HIGH</name>
          <description>MSPI ECO high register</description>
          <addressOffset>0x3f0</addressOffset>
          <size>32</size>
          <resetValue>0x37c</resetValue>
          <fields>
            <field>
              <name>MEM_REGISTERRND_ECO_HIGH</name>
              <description>ECO high register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_REGISTERRND_ECO_LOW</name>
          <description>MSPI ECO low register</description>
          <addressOffset>0x3f4</addressOffset>
          <size>32</size>
          <resetValue>0x37c</resetValue>
          <fields>
            <field>
              <name>MEM_REGISTERRND_ECO_LOW</name>
              <description>ECO low register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_DATE</name>
          <description>SPI0 version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2412300</resetValue>
          <fields>
            <field>
              <name>MEM_DATE</name>
              <description>SPI0 register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
