esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
        <register>
          <name>MOSI_DLEN</name>
          <description>SPI1 send data bit length control register.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USR_MOSI_DBITLEN</name>
              <description>The length in bits of write-data. The register value shall be (bit_num-1).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISO_DLEN</name>
          <description>SPI1 receive data bit length control register.</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USR_MISO_DBITLEN</name>
              <description>The length in bits of  read-data. The register value shall be (bit_num-1).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_STATUS</name>
          <description>SPI1 status register.</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS</name>
              <description>The value is stored when set spi_mem_flash_rdsr bit and spi_mem_flash_res bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_MODE</name>
              <description>Mode bits in the flash fast read mode  it is combined with spi_mem_fastrd_mode bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_MODE_BITLEN</name>
              <description>Mode bits length for flash fast read mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_MODE_EN</name>
              <description>Mode bits is valid while this bit is enable. 1: enable 0: disable.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>SPI1 misc register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>CS0_DIS</name>
              <description>SPI_CS0 pin enable, 1: disable SPI_CS0, 0: SPI_CS0 pin is active to select SPI device, such as flash, external RAM and so on.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS1_DIS</name>
              <description>SPI_CS1 pin enable, 1: disable SPI_CS1, 0: SPI_CS1 pin is active to select SPI device, such as flash, external RAM and so on.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CK_IDLE_EDGE</name>
              <description>1: spi clk line is high when idle     0: spi clk line is low when idle</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS_KEEP_ACTIVE</name>
              <description>spi cs line keep low when the bit is set.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CRC</name>
          <description>SPI1 TX CRC data register.</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>For SPI1, the value of crc32.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_FCTRL</name>
          <description>SPI1 bit mode control register.</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CACHE_USR_ADDR_4BYTE</name>
              <description>For SPI1,  cache  read flash with 4 bytes address, 1: enable, 0:disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDIN_DUAL</name>
              <description>For SPI1, din phase apply 2 signals. 1: enable 0: disable. The bit is the same with spi_mem_fread_dio.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDOUT_DUAL</name>
              <description>For SPI1, dout phase apply 2 signals. 1: enable 0: disable. The bit is the same with spi_mem_fread_dio.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FADDR_DUAL</name>
              <description>For SPI1, address phase apply 2 signals. 1: enable 0: disable.  The bit is the same with spi_mem_fread_dio.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDIN_QUAD</name>
              <description>For SPI1, din phase apply 4 signals. 1: enable 0: disable.  The bit is the same with spi_mem_fread_qio.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDOUT_QUAD</name>
              <description>For SPI1, dout phase apply 4 signals. 1: enable 0: disable.  The bit is the same with spi_mem_fread_qio.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FADDR_QUAD</name>
              <description>For SPI1, address phase apply 4 signals. 1: enable 0: disable.  The bit is the same with spi_mem_fread_qio.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W0</name>
          <description>SPI1 memory data buffer0</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF0</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W1</name>
          <description>SPI1 memory data buffer1</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF1</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W2</name>
          <description>SPI1 memory data buffer2</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF2</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W3</name>
          <description>SPI1 memory data buffer3</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF3</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W4</name>
          <description>SPI1 memory data buffer4</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF4</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W5</name>
          <description>SPI1 memory data buffer5</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF5</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W6</name>
          <description>SPI1 memory data buffer6</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF6</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W7</name>
          <description>SPI1 memory data buffer7</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF7</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W8</name>
          <description>SPI1 memory data buffer8</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF8</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W9</name>
          <description>SPI1 memory data buffer9</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF9</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W10</name>
          <description>SPI1 memory data buffer10</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF10</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W11</name>
          <description>SPI1 memory data buffer11</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF11</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W12</name>
          <description>SPI1 memory data buffer12</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF12</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W13</name>
          <description>SPI1 memory data buffer13</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF13</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W14</name>
          <description>SPI1 memory data buffer14</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF14</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>W15</name>
          <description>SPI1 memory data buffer15</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUF15</name>
              <description>data buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WAITI_CTRL</name>
          <description>SPI1 wait idle control register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x50001</resetValue>
          <fields>
            <field>
              <name>WAITI_EN</name>
              <description>1: The hardware will wait idle after SE/PP/WRSR automatically, and hardware auto Suspend/Resume can be enabled. 0: The functions of hardware wait idle and auto Suspend/Resume are not supported.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAITI_DUMMY</name>
              <description>The dummy phase enable when wait flash idle (RDSR)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAITI_ADDR_EN</name>
              <description>1: Output  address 0 in RDSR or read SUS command transfer. 0: Do not send out address in RDSR or read SUS command transfer.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAITI_ADDR_CYCLELEN</name>
              <description>When SPI_MEM_WAITI_ADDR_EN is set, the  cycle length of sent out address is (SPI_MEM_WAITI_ADDR_CYCLELEN[1:0] + 1) SPI  bus clock cycles. It is not active when SPI_MEM_WAITI_ADDR_EN is cleared.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAITI_CMD_2B</name>
              <description>1:The wait idle command bit length is 16. 0: The wait idle command bit length is 8.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAITI_DUMMY_CYCLELEN</name>
              <description>The dummy cycle length when wait flash idle(RDSR).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAITI_CMD</name>
              <description>The command value to wait flash idle(RDSR).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SUS_CTRL</name>
          <description>SPI1 flash suspend control register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x8002000</resetValue>
          <fields>
            <field>
              <name>FLASH_PER</name>
              <description>program erase resume bit, program erase suspend operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_PES</name>
              <description>program erase suspend bit, program erase suspend operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_PER_WAIT_EN</name>
              <description>1: SPI1 waits (SPI_MEM_CS_HOLD_DELAY_RES[9:0] * 4 or *128) SPI_CLK cycles after program erase resume command is sent. 0: SPI1 does not wait after program erase resume command is sent.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_PES_WAIT_EN</name>
              <description>1: SPI1 waits (SPI_MEM_CS_HOLD_DELAY_RES[9:0] * 4 or *128) SPI_CLK cycles after program erase suspend command is sent. 0: SPI1 does not wait after program erase suspend command is sent.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PES_PER_EN</name>
              <description>Set this bit to enable PES end triggers PER transfer option. If this bit is 0, application should send PER after PES is done.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_PES_EN</name>
              <description>Set this bit to enable Auto-suspending function.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PESR_END_MSK</name>
              <description>The mask value when check SUS/SUS1/SUS2 status bit. If the read status value is status_in[15:0](only status_in[7:0] is valid when only one byte of data is read out, status_in[15:0] is valid when two bytes of data are read out), SUS/SUS1/SUS2 = status_in[15:0]^ SPI_MEM_PESR_END_MSK[15:0].</description>
              <bitOffset>6</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_RD_SUS_2B</name>
              <description>1: Read two bytes when check flash SUS/SUS1/SUS2 status bit. 0:  Read one byte when check flash SUS/SUS1/SUS2 status bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PER_END_EN</name>
              <description>1: Both WIP and SUS/SUS1/SUS2 bits should be checked to insure the resume status of flash. 0: Only need to check WIP is 0.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PES_END_EN</name>
              <description>1: Both WIP and SUS/SUS1/SUS2 bits should be checked to insure the suspend status of flash. 0: Only need to check WIP is 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUS_TIMEOUT_CNT</name>
              <description>When SPI1 checks SUS/SUS1/SUS2 bits fail for SPI_MEM_SUS_TIMEOUT_CNT[6:0] times, it will be treated as check pass.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SUS_CMD</name>
          <description>SPI1 flash suspend command register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x57575</resetValue>
          <fields>
            <field>
              <name>FLASH_PES_COMMAND</name>
              <description>Program/Erase suspend command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT_PESR_COMMAND</name>
              <description>Flash SUS/SUS1/SUS2 status bit read command. The command should be sent when SUS/SUS1/SUS2 bit should be checked to insure the suspend or resume status of flash.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
