esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
        <register>
          <name>INT_RAW</name>
          <description>Interrupt raw register of system timer</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET0_INT_RAW</name>
              <description>The raw interrupt status of SYSTIMER_TARGET0_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET1_INT_RAW</name>
              <description>The raw interrupt status of SYSTIMER_TARGET1_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET2_INT_RAW</name>
              <description>The raw interrupt status of SYSTIMER_TARGET2_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear register of system timer</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET0_INT_CLR</name>
              <description>Write 1 to clear SYSTIMER_TARGET0_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TARGET1_INT_CLR</name>
              <description>Write 1 to clear SYSTIMER_TARGET1_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TARGET2_INT_CLR</name>
              <description>Write 1 to clear SYSTIMER_TARGET2_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Interrupt status register of system timer</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET0_INT_ST</name>
              <description>The interrupt status of SYSTIMER_TARGET0_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TARGET1_INT_ST</name>
              <description>The interrupt status of SYSTIMER_TARGET1_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TARGET2_INT_ST</name>
              <description>The interrupt status of SYSTIMER_TARGET2_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REAL_TARGET0_LO</name>
          <description>Actual target value of COMP0, low 32 bits</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET0_LO_RO</name>
              <description>Represents the actual target value of COMP0, low 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REAL_TARGET0_HI</name>
          <description>Actual target value of COMP0, high 20 bits</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET0_HI_RO</name>
              <description>Represents the actual target value of COMP0, high 20 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REAL_TARGET1_LO</name>
          <description>Actual target value of COMP1, low 32 bits</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET1_LO_RO</name>
              <description>Represents the actual target value of COMP1, low 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REAL_TARGET1_HI</name>
          <description>Actual target value of COMP1, high 20 bits</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET1_HI_RO</name>
              <description>Represents the actual target value of COMP1, high 20 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REAL_TARGET2_LO</name>
          <description>Actual target value of COMP2, low 32 bits</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET2_LO_RO</name>
              <description>Represents the actual target value of COMP2, low 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REAL_TARGET2_HI</name>
          <description>Actual target value of COMP2, high 20 bits</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TARGET2_HI_RO</name>
              <description>Represents the actual target value of COMP2, high 20 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2312220</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
