esp-rs/esp-pacs/esp32c61/svd/esp32c61.base.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMG0">
      <name>TIMG1</name>
      <baseAddress>0x60009000</baseAddress>
      <description>Timer Group 1</description>
      <interrupt>
        <name>TG1_T0_LEVEL</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>TG1_T1_LEVEL</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>TG1_WDT_LEVEL</name>
        <value>51</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TRACE</name>
      <description>RISC-V Trace Encoder</description>
      <groupName>TRACE</groupName>
      <baseAddress>0x600c0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4c</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TRACE</name>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>MEM_START_ADDR</name>
          <description>Memory start address</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_START_ADDR</name>
              <description>Configures the start address of the trace memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_END_ADDR</name>
          <description>Memory end address</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>MEM_END_ADDR</name>
              <description>Configures the end address of the trace memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CURRENT_ADDR</name>
          <description>Memory current addr</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_CURRENT_ADDR</name>
              <description>Represents the current memory address for writing.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_ADDR_UPDATE</name>
          <description>Memory address update</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_CURRENT_ADDR_UPDATE</name>
              <description>Configures whether to update the value of \hyperref[fielddesc:TRACEMEMCURRENTADDR]{TRACE_MEM_CURRENT_ADDR} to \hyperref[fielddesc:TRACEMEMSTARTADDR]{TRACE_MEM_START_ADDR}.\\
0: Not update\\
1: Update\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_STATUS</name>
          <description>FIFO status register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>FIFO_EMPTY</name>
              <description>Represent whether the FIFO is empty. \\1: Empty \\0: Not empty</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORK_STATUS</name>
              <description>Represent the state of the encoder: \\0: Idle state \\1: Working state\\ 2: Wait state becasue hart is halted or in reset \\3: Lost state\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_ENA</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FIFO_OVERFLOW_INTR_ENA</name>
              <description>Write 1 to enable TRACE_FIFO_OVERFLOW_INTR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_FULL_INTR_ENA</name>
              <description>Write 1 to enable TRACE_MEM_FULL_INTR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_RAW</name>
          <description>Interrupt raw status register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FIFO_OVERFLOW_INTR_RAW</name>
              <description>The raw interrupt status of TRACE_FIFO_OVERFLOW_INTR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_FULL_INTR_RAW</name>
              <description>The raw interrupt status of TRACE_MEM_FULL_INTR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_CLR</name>
          <description>Interrupt clear register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FIFO_OVERFLOW_INTR_CLR</name>
              <description>Write 1 to clear TRACE_FIFO_OVERFLOW_INTR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEM_FULL_INTR_CLR</name>
              <description>Write 1 to clear TRACE_MEM_FULL_INTR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGGER</name>
          <description>Trace enable register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0xc</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>Configure whether to enable the encoder.\\0: Invalid \\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OFF</name>
              <description>Configure whether to disable the encoder.\\0: Invalid \\1: Disable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEM_LOOP</name>
              <description>Configure the memory writing mode. \\0: Non-loop mode. \\1: Loop mode\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESTART_ENA</name>
              <description>Configure whether or not enable automatic restart function for the encoder.\\0: Disable\\1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>trace configuration register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DM_TRIGGER_ENA</name>
              <description>Configure whether to enable the trigger signal.\\0: Disable\\1:enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_ENA</name>
              <description>Configure whether to reset, when enabeld, if cpu have reset, the encoder will output a packet to report the address of the last instruction, and upon reset deassertion, the encoder start again.\\0: Disable\\0: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALT_ENA</name>
              <description>Configure whether to enable the halt signal. \\1: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL_ENA</name>
              <description>Configure whether to enable the stall signal. \\0: Disable.\\1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FULL_ADDRESS</name>
              <description>Configure the address mode.\\0: Delta address mode.\\1: Full address mode.\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IMPLICIT_EXCEPT</name>
              <description>Configure whether or not enabel implicit exception mode. When enabled,, do not sent exception address, only exception cause in exception packets.\\1: enabled\\0: disabled\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_CONTROL</name>
          <description>filter control register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>Configure whether to enable filtering. \\0: Disable, always match.\\ 1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_COMP</name>
              <description>Configure whether to enable the comparator match mode. \\0: Disable \\1: Enable, the comparator must be high in order for the filter to match</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_PRIVILEGE</name>
              <description>Configure whether to enable the privilege match mode. \\0: Disable \\1: Enable, match privilege levels specified by \hyperref[fielddesc:TRACEMATCHCHOICEPRIVILEGE]{TRACE_MATCH_CHOICE_PRIVILEGE}.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_ECAUSE</name>
              <description>Configure whether to enable ecause match mode. \\0: Disable \\1: Enable, start matching from exception cause codes specified by \hyperref[fielddesc:TRACEMATCHCHOICEECAUSE]{TRACE_MATCH_CHOICE_ECAUSE}, and stop matching upon return from the 1st matching exception.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_INTERRUPT</name>
              <description>Configure whether to enable the interrupt match mode. \\0: Disable \\1: Enable, start matching from a trap with the interrupt level codes specified by \hyperref[fielddesc:TRACEMATCHVALUEINTERRUPT]{TRACE_MATCH_VALUE_INTERRUPT}, and stop matching upon return from the 1st matching trap.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_MATCH_CONTROL</name>
          <description>filter match control register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MATCH_CHOICE_PRIVILEGE</name>
              <description>Configures the privilege level for matching. Valid only when \hyperref[fielddesc:TRACEMATCHPRIVILEGE]{TRACE_MATCH_PRIVILEGE} is set. \\0: User mode. \\1: Machine mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_VALUE_INTERRUPT</name>
              <description>Configures the interrupt level for match. Valid only when when \hyperref[fielddesc:TRACEMATCHINTERRUPT]{TRACE_MATCH_INTERRUP} is set. \\0: itype=2. \\0: itype=2.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_CHOICE_ECAUSE</name>
              <description>Configures the ecause code for matching.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_COMPARATOR_CONTROL</name>
          <description>filter comparator match control register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P_INPUT</name>
              <description>Configures the input of the primary comparator for matching: \\0: iaddr \\1: tval\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P_FUNCTION</name>
              <description>Configures the function for the primary comparator. \\0: Equal, \\1: Not equal, \\2: Less than, \\3: Less than or equal, \\4: Greater than, \\5: Greater than or equal, \\Other: Always match</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P_NOTIFY</name>
              <description>Configure whether to explicitly report an instruction address matched against the primary comparator. \\0:Not report \\1:Report</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_INPUT</name>
              <description>Configures the input of the secondary comparator for matching: \\0: iaddr \\1: tval\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_FUNCTION</name>
              <description>Configures the function for the secondary comparator. \\0: Equal, \\1: Not equal, \\2: Less than, \\3: Less than or equal, \\4: Greater than, \\5: Greater than or equal, \\Other: Always match</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S_NOTIFY</name>
              <description>Generate a trace packet explicitly reporting the address that cause the secondary match</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_MODE</name>
              <description>Configures the comparator match mode: \\0: Only the primary comparator matches \\1: Both primary and secondary comparator matches(P\&amp;\&amp;S) \\ 2:Neither primary or secondary comparator matches !(P\&amp;\&amp;S) \\3: Start filtering when the primary comparator matches and stop filtering when the secondary comparator matches\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_P_COMPARATOR_MATCH</name>
          <description>primary comparator match value</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P_MATCH</name>
              <description>Configures the match value for the primary comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_S_COMPARATOR_MATCH</name>
          <description>secondary comparator match value</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S_MATCH</name>
              <description>Configures the match value for the secondary comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESYNC_PROLONGED</name>
          <description>Resync configuration register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>RESYNC_PROLONGED</name>
              <description>Configures the threshold for synchronization counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESYNC_MODE</name>
              <description>Configures the synchronization mode: \\0: Disable the synchronization counter \\1: Invalid \\2: Synchronization counter counts by packet  \\3: Synchronization counter counts by cycle\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_CONFIG</name>
          <description>AHB config register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HBURST</name>
              <description>Configures the AHB burst mode. \\0: SIGNLE \\1: INCR(length not defined) \\2:INCR4 \\4:INCR8 \\Others:Invalid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_INCR</name>
              <description>Configures the maximum burst length for INCR mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gate control register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures register clock gating. \\0: Support clock only when the application writes registers to save power. \\1:Always force the clock on for registers \\ This bit does't affect register access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2211300</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
